* Prepare Moudle Name = directory name
#+NAME: module
#+BEGIN_SRC elisp  :results value
  (last
   (split-string
    (replace-regexp-in-string "/" " "   (expand-file-name "")) ))
#+END_SRC

#+RESULTS: module
| friends-aneesha |
* Npm module INIT
  CLOCK: [2016-01-13 Wed 04:48]--[2016-01-13 Wed 04:55] =>  0:07
  :PROPERTIES:
  :Effort:   0:08
  :END:
#+BEGIN_SRC sh :var EMAIL="chowdhury.k.ashraf@gmail.com" URL="http://23.227.183.105"
  npm set init-author-email $EMAIL
  npm set init-author-url $URL
  npm set init-license=MIT
  npm set save-exact true
  echo $EMAIL $URL
#+END_SRC

#+RESULTS:
: chowdhury.k.ashraf@gmail.com http://23.227.183.105

** [[~/.npmrc][npm rc]] for npm setting
** Add npm user
   CLOCK: [2016-01-13 Wed 08:12]--[2016-01-13 Wed 08:35] =>  0:23
   CLOCK: [2016-01-13 Wed 07:52]--[2016-01-13 Wed 08:12] =>  0:20
   CLOCK: [2016-01-13 Wed 06:10]--[2016-01-13 Wed 06:11] =>  0:01
   :PROPERTIES:
   :Effort:   0:23
   :END:

#+CALL: cmdaync(cmd="npm adduser")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha

*** Send data to PIPE
   CLOCK: [2016-01-13 Wed 05:47]--[2016-01-13 Wed 05:58] =>  0:11
   :PROPERTIES:
   :Effort:   0:10
   :END:
#+NAME: cmdaync
#+BEGIN_SRC sh :var cmd="" :var mod=module[0] :noweb yes
<<check_pipeserver_running>>
echo  $cmd   > $pipe
#+END_SRC

#+RESULTS:
: command npm adduser is sended to /tmp/friends-aneesha

**** check_pipeserver_running
#+NAME: check_pipeserver_running
#+BEGIN_SRC sh
pipe="/tmp/"$mod
[ ! -p $pipe ] && exit 1 || echo "command $DT is sended to $pipe"
#+END_SRC

#+RESULTS: check_pipeserver_running
: command  is sended to /tmp/friends-aneesha

**** test Inline if
#+BEGIN_SRC sh
if [ $counter -eq 1 ] then; echo "true";
#+END_SRC

** npm init
*** Check NPM Version
#+BEGIN_SRC sh :results verbatim drawer
npm version
#+END_SRC

#+RESULTS:
:RESULTS:
{ npm: '3.5.0',
  ares: '1.10.1-DEV',
  http_parser: '2.5.0',
  modules: '46',
  node: '4.2.1',
  openssl: '1.0.2d',
  uv: '1.7.5',
  v8: '4.5.103.35',
  zlib: '1.2.8' }
:END:
*** init cmd
#+CALL: cmdaync(cmd="npm init")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha
*** [[./package.json][package]]
* init module
** Module firend_anneesha
*** Install unique-random-array
#+BEGIN_SRC sh :resutls verbatim drawer
npm install unique-random-array
#+END_SRC

#+RESULTS:
*** Write module [[./src/index.js][module src]]
#+BEGIN_SRC js :tangle src/index.js :mkdirp yes
var uniqueRandomArray = require('unique-random-array');
var starWarsNames = require('./friends-names.json');

module.exports = {
  all: starWarsNames,
  random: uniqueRandomArray(starWarsNames)
};
#+END_SRC
** data init
#+BEGIN_SRC js :tangle src/friends-names.json
[
  "Aneesha",
  "Ghumpori",
  "Maliha",
  "Shamaila",
  "Liana",
  "Asia",
  "Arjab",
  "Esha",
  "Rumaita",
  "Faiz",
  "Aiyan"
]
#+END_SRC

** import library
#+BEGIN_SRC js :cmd "babel-node" :tangle repl/friends-names.js :results output drawer :mkdirp yes
  let lib = require(process.cwd() + '/src/index.js');
  console.log('|random friend | ' + lib.random());
  console.log('|list of friends| ' + lib.all);
#+END_SRC

#+RESULTS:
:RESULTS:
| random friend   | Arjab                                                                     |
| list of friends | Aneesha,Ghumpori,Maliha,Shamaila,Liana,Asia,Arjab,Esha,Rumaita,Faiz,Aiyan |
:END:

* Setup GIT
** Prepare [[README.md]]
#+BEGIN_SRC elisp :var filename=module[0]
  (defun ash-append-string-to-file (s filename)
    (with-temp-buffer
      (insert s)
      (when (file-writable-p filename)
         (write-region (point-min) (point-max) filename nil))))
  (ash-append-string-to-file (concat "# " filename "\n" ) "README.md" )
#+END_SRC

#+RESULTS:

*** Prepare Test
#+BEGIN_SRC elisp
  (defun file-string (file)
    "Read the contents of a file and return as a string."
    (with-temp-buffer
      (insert-file-contents file)
      (buffer-string)))
  (file-string "README.md")
#+END_SRC
#+RESULTS:
: # friends-aneesha

** Git Init
#+BEGIN_SRC sh
git init
git remote add origin https://github.com/chowdhuryashraf/friends-aneesha.git
git remote -v
#+END_SRC

#+RESULTS:
| Reinitialized | existing                                               | Git     | repository | in | /usr/local/src/microlibrary/friends-aneesha/.git/ |
| origin        | [[https://github.com/chowdhuryashraf/friends-aneesha.git]] | (fetch) |            |    |                                                   |
| origin        | [[https://github.com/chowdhuryashraf/friends-aneesha.git]] | (push)  |            |    |                                                   |

* Npm publish
** Publish to npm
   CLOCK: [2016-01-13 Wed 15:04]--[2016-01-13 Wed 15:05] =>  0:01
#+BEGIN_SRC sh
npm publish
#+END_SRC

#+RESULTS:
: + friends-aneesha@1.0.0
** Check details
#+BEGIN_SRC sh :results output
npm info friends-aneesha
#+END_SRC

#+RESULTS:
#+begin_example

{ name: 'friends-aneesha',
  description: 'New Module bootstrap',
  'dist-tags': { latest: '1.0.0' },
  versions: [ '1.0.0' ],
  maintainers: [ 'chowdhuryashraf <chowdhury.k.ashraf@gmail.com>' ],
  time:
   { modified: '2016-01-13T19:24:52.189Z',
     created: '2016-01-13T19:24:52.189Z',
     '1.0.0': '2016-01-13T19:24:52.189Z' },
  homepage: 'https://github.com/chowdhuryashraf/friends-aneesha#readme',
  keywords: [ 'bootstart', 'module' ],
  repository:
   { type: 'git',
     url: 'git+https://github.com/chowdhuryashraf/friends-aneesha.git' },
  author: 'Chowdhury Ashraf',
  bugs: { url: 'https://github.com/chowdhuryashraf/friends-aneesha/issues' },
  license: 'MIT',
  readmeFilename: 'README.md',
  version: '1.0.0',
  main: 'src/index.js',
  dependencies: { 'unique-random-array': '1.0.0' },
  devDependencies: {},
  scripts: { test: 'echo "Error: no test specified" && exit 1' },
  gitHead: '40e950b9d7a1cf1905ef0b028d46f940c35fcbfb',
  dist:
   { shasum: 'afeae752a81af64401436d7d250996d3ce3e9a96',
     tarball: 'http://registry.npmjs.org/friends-aneesha/-/friends-aneesha-1.0.0.tgz' },
  directories: {} }

#+end_example

** Deploy other place
   CLOCK: [2016-01-13 Wed 14:39]--[2016-01-13 Wed 15:04] =>  0:25
   :PROPERTIES:
   :Effort:   0:05
   :dir: /usr/local/src/microlibrary/testmicro
   :END:

#+BEGIN_SRC sh
npm install friends-aneesha
#+END_SRC

#+RESULTS:
| /usr/local/src/microlibrary/testmicro |                           |
| └─┬                                   | friends-aneesha@1.0.0     |
| └─┬                                   | unique-random-array@1.0.0 |
| └──                                   | unique-random@1.0.0       |
|                                       |                           |
#+NAME: mpath
#+BEGIN_SRC elisp
(expand-file-name "node_modules/")
#+END_SRC

#+RESULTS:
: /usr/local/src/microlibrary/testmicro/node_modules/

#+BEGIN_SRC js :cmd "babel-node" :var path=mpath[0]   :results output drawer
let friendsAneesha = require(path + 'friends-aneesha')
console.log(friendsAneesha.all);
console.log(friendsAneesha.random());
console.log(friendsAneesha.random());
console.log(friendsAneesha.random());
console.log(friendsAneesha.random());
#+END_SRC

#+RESULTS:
:RESULTS:
[ 'Aneesha',
  'Ghumpori',
  'Maliha',
  'Shamaila',
  'Liana',
  'Asia',
  'Arjab',
  'Esha',
  'Rumaita',
  'Faiz',
  'Aiyan' ]
Liana
Shamaila
Aneesha
Maliha
:END:

* Git TAG
#+NAME: gittag
#+BEGIN_SRC sh :var tag=""
git tag $tag
#+END_SRC

#+RESULTS:
* Publishing a beta version
** Adding 2 names in aneesha's [[/usr/local/src/microlibrary/friends-aneesha/src/friends-names.json][friend list]]
#+BEGIN_EXAMPLE
@@ -1,4 +1,3 @@
-
 [
   "Aneesha",
   "Ghumpori",
@@ -10,5 +9,7 @@
   "Esha",
   "Rumaita",
   "Faiz",
-  "Aiyan"
+  "Aiyan",
+  "Baby Baby2",
+  "Bandhan"
 ]

#+END_EXAMPLE
** Update Git Tag
#+CALL: gittag("1.4.0-beta.0")

#+RESULTS:
: nil

** package.json
#+BEGIN_EXAMPLE
modified   package.json
@@ -1,6 +1,6 @@
 {
   "name": "friends-aneesha",
-  "version": "1.0.0",
+  "version": "1.4.0-beta.0",
#+END_EXAMPLE
** Publish Beta release to Npm
#+BEGIN_SRC sh
npm publish --tag beta
#+END_SRC

#+RESULTS:
: + friends-aneesha@1.4.0-beta.0
*** Get info
#+BEGIN_SRC sh :results replace output
npm info
#+END_SRC

#+RESULTS:
#+begin_example

{ name: 'friends-aneesha',
  description: 'New Module bootstrap',
  'dist-tags': { latest: '1.0.0', beta: '1.4.0-beta.0' },
  versions: [ '1.0.0', '1.4.0-beta.0' ],
  maintainers: [ 'chowdhuryashraf <chowdhury.k.ashraf@gmail.com>' ],
  time:
   { modified: '2016-01-17T21:39:15.651Z',
     created: '2016-01-13T19:24:52.189Z',
     '1.0.0': '2016-01-13T19:24:52.189Z',
     '1.4.0-beta.0': '2016-01-17T21:39:15.651Z' },
  homepage: 'https://github.com/chowdhuryashraf/friends-aneesha#readme',
  keywords: [ 'bootstart', 'module' ],
  repository:
   { type: 'git',
     url: 'git+https://github.com/chowdhuryashraf/friends-aneesha.git' },
  author: 'Chowdhury Ashraf',
  bugs: { url: 'https://github.com/chowdhuryashraf/friends-aneesha/issues' },
  license: 'MIT',
  readmeFilename: 'README.md',
  version: '1.0.0',
  main: 'src/index.js',
  dependencies: { 'unique-random-array': '1.0.0' },
  devDependencies: {},
  scripts: { test: 'echo "Error: no test specified" && exit 1' },
  gitHead: '40e950b9d7a1cf1905ef0b028d46f940c35fcbfb',
  dist:
   { shasum: 'afeae752a81af64401436d7d250996d3ce3e9a96',
     tarball: 'http://registry.npmjs.org/friends-aneesha/-/friends-aneesha-1.0.0.tgz' },
  directories: {} }

#+end_example

** Deploy other place
   CLOCK: [2016-01-13 Wed 14:39]--[2016-01-13 Wed 15:04] =>  0:25
   :PROPERTIES:
   :Effort:   0:05
   :dir: /usr/local/src/microlibrary/testmicro
   :END:

#+BEGIN_SRC sh
npm install friends-aneesha@beta
#+END_SRC

#+RESULTS:
| /usr/local/src/microlibrary/testmicro |                              |
| └──                                   | friends-aneesha@1.4.0-beta.0 |
|                                       |                              |
#+NAME: mpath
#+BEGIN_SRC elisp
(expand-file-name "node_modules/")
#+END_SRC

#+RESULTS:
: /usr/local/src/microlibrary/testmicro/node_modules/

#+BEGIN_SRC js :cmd "babel-node" :var path=mpath[0]   :results output drawer
let friendsAneesha = require(path + 'friends-aneesha')
console.log(friendsAneesha.all);
console.log(friendsAneesha.random());
console.log(friendsAneesha.random());
console.log(friendsAneesha.random());
console.log(friendsAneesha.random());
#+END_SRC

#+RESULTS:
:RESULTS:
[ 'Aneesha',
  'Ghumpori',
  'Maliha',
  'Shamaila',
  'Liana',
  'Asia',
  'Arjab',
  'Esha',
  'Rumaita',
  'Faiz',
  'Aiyan',
  'Baby Baby2',
  'Bandhan' ]
Rumaita
Maliha
Arjab
Esha
:END:
* Test
* Test friends-aneesha@1.4.0-beta.0
** Adding test libraries mocha chai
#+BEGIN_SRC sh
npm install --save-dev mocha
#+END_SRC

#+BEGIN_SRC sh
npm install --save-dev chai
#+END_SRC

#+RESULTS:
| friends-aneesha@1.4.0-beta.0 | /usr/local/src/microlibrary/friends-aneesha |                       |                   |
| ├─┬                          | chai@3.4.1                                  |                       |                   |
| │                            | ├──                                         | assertion-error@1.0.1 |                   |
| │                            | ├─┬                                         | deep-eql@0.1.3        |                   |
| │                            | │                                           | └──                   | type-detect@0.1.1 |
| │                            | └──                                         | type-detect@1.0.0     |                   |
| └──                          | unique-random-array@1.0.0                   |                       |                   |
|                              |                                             |                       |                   |

#+BEGIN_SRC sh
npm list mocha chi
#+END_SRC

#+RESULTS:
| friends-aneesha@1.4.0-beta.0 | /usr/local/src/microlibrary/friends-aneesha |
| ├──                          | chi@0.0.10                                  |
| └──                          | mocha@2.3.4                                 |
|                              |                                             |

#+BEGIN_SRC sh
npm list
#+END_SRC

#+RESULTS:
| friends-aneesha@1.4.0-beta.0 | /usr/local/src/microlibrary/friends-aneesha |                            |                   |
| ├─┬                          | chai@3.4.1                                  |                            |                   |
| │                            | ├──                                         | assertion-error@1.0.1      |                   |
| │                            | ├─┬                                         | deep-eql@0.1.3             |                   |
| │                            | │                                           | └──                        | type-detect@0.1.1 |
| │                            | └──                                         | type-detect@1.0.0          |                   |
| ├─┬                          | mocha@2.3.4                                 |                            |                   |
| │                            | ├──                                         | commander@2.3.0            |                   |
| │                            | ├─┬                                         | debug@2.2.0                |                   |
| │                            | │                                           | └──                        | ms@0.7.1          |
| │                            | ├──                                         | diff@1.4.0                 |                   |
| │                            | ├──                                         | escape-string-regexp@1.0.2 |                   |
| │                            | ├─┬                                         | glob@3.2.3                 |                   |
| │                            | │                                           | ├──                        | graceful-fs@2.0.3 |
| │                            | │                                           | ├──                        | inherits@2.0.1    |
| │                            | │                                           | └─┬                        | minimatch@0.2.14  |
| │                            | │                                           | ├──                        | lru-cache@2.7.3   |
| │                            | │                                           | └──                        | sigmund@1.0.1     |
| │                            | ├──                                         | growl@1.8.1                |                   |
| │                            | ├─┬                                         | jade@0.26.3                |                   |
| │                            | │                                           | ├──                        | commander@0.6.1   |
| │                            | │                                           | └──                        | mkdirp@0.3.0      |
| │                            | ├─┬                                         | mkdirp@0.5.0               |                   |
| │                            | │                                           | └──                        | minimist@0.0.8    |
| │                            | └──                                         | supports-color@1.2.0       |                   |
| └─┬                          | unique-random-array@1.0.0                   |                            |                   |
| └──                          | unique-random@1.0.0                         |                            |                   |
|                              |                                             |                            |                   |
** wrote [[file:src/index.test.js][test module]]
#+NAME: test_friends
#+BEGIN_SRC js
var expect = require('chai').expect;
var friends = require('./index');

describe('firends-anneesha', function() {
  describe('all', function() {
    it('should be an array of strings', function() {
      expect(friends.all).to.satisfy(isArrayOfStrings);

      function isArrayOfStrings(array) {
        return array.every(function(item) {
           return typeof item === 'string';
        });
      }
    });
    it('should contain `bandhan`', function() {
      expect(friends.all).to.include('Bandhan');
    });
  });
  describe('random', function() {
    it('should return a random item from the starWars.all', function() {
      var randomItem = friends.random();
      expect(friends.all).to.include(randomItem);
    });
  });
});
#+END_SRC

* Automating Releases with semantic-release
** install semantic-release
#+call: cmdaync("npm install -D semantic-release")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha

** install commitizen and cz-conventional-changelog
#+call: cmdaync("npm install -D commitizen  cz-conventional-changelog")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha
#+BEGIN_SRC sh
npm list commitizen  cz-conventional-changelog
#+END_SRC

#+RESULTS:
| friends-aneesha@1.4.0-beta.0 | /usr/local/src/microlibrary/friends-aneesha |                                 |
| ├─┬                          | commitizen@2.5.0                            |                                 |
| │                            | └──                                         | cz-conventional-changelog@1.1.4 |
| └──                          | cz-conventional-changelog@1.1.5             |                                 |
|                              |                                             |                                 |

** Update [[file:.travis.yml][Travis CI ]]
** commit git with npm
#+call: cmdaync("npm run commit")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha
* Add new feature *returns array of random number*
#+BEGIN_EXAMPLE
*** /tmp/ediff25330DRd	2016-01-18 16:26:52.536000000 -0500
--- /tmp/ediff25330Qbj	2016-01-18 16:26:52.540000000 -0500
***************
*** 1,8 ****
-
  var uniqueRandomArray = require('unique-random-array');
! var starWarsNames = require('./friends-names.json');

  module.exports = {
!   all: starWarsNames,
!   random: uniqueRandomArray(starWarsNames)
  };
--- 1,20 ----
  var uniqueRandomArray = require('unique-random-array');
! var nameOfFriendsOfAneesha = require('./friends-names.json');
! var getRandomItem = uniqueRandomArray(nameOfFriendsOfAneesha);
! var randomItems = [];

  module.exports = {
!   all: nameOfFriendsOfAneesha,
!   random: random
  };
+
+ function random(number){
+   if (number === undefined){
+     return getRandomItem();
+   }
+   if ( number > 0 ){
+     randomItems.push(getRandomItem());
+     return random( number - 1);
+   }
+   return randomItems;
+ }

#+END_EXAMPLE
#+BEGIN_EXAMPLE
*** /tmp/ediff25330QpL	2016-01-18 16:37:28.704000000 -0500
--- /tmp/ediff25330dzR	2016-01-18 16:37:28.704000000 -0500
***************
*** 21,25 ****
--- 21,33 ----
        var randomItem = friends.random();
        expect(friends.all).to.include(randomItem);
      });
+
+     it('should return an array of random items if passed a number', function() {
+       var randomItems = friends.random(3);
+       expect(randomItems).to.have.length(3);
+       randomItems.map(function(item) {
+         expect(friends.all).to.include(item);
+       });
+     });
    });
  });

#+END_EXAMPLE
* run num git
#+call: cmdaync("npm run commit")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha
#+call: cmdaync("git push origin master")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha

#+call: cmdaync("npm run commit")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha
